# 정렬Sort

- 데이터 정렬
- 기준
    - 인덱스 -> sort_index()
    - 값 -> sort_value()

In [92]:
import pandas as pd
import numpy as np           # nan 사용하기 위함

# 데이터 생성
df=pd.DataFrame({'value':[4,1,2,3,5],
               'name':['John Kim', 'GilDong Hong', 'Tom', 'Lee', 'Annan Jung'],
               'age':[12, np.nan, 10, 6, np.nan]})
# 데이터 정보확인
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   value   5 non-null      int64
 1   name    5 non-null      object
 2   age     3 non-null      float64
dtypes: float64(1), int64(1), object(1)
memory usage: 248.0+ bytes

In [93]:
# 인덱스 & 컬럼 확인
print(df.index, df.columns, sep='\n')

RangeIndex(start=0, stop=5, step=1)
Index(['value', 'name', 'age'], dtype='object')

In [94]:
# 정렬하기, [기본값] 오름차순
df.sort_index()

   value          name   age
0      4      John Kim  12.0
1      1  GilDong Hong   NaN
2      2           Tom  10.0
3      3           Lee   6.0
4      5    Annan Jung   NaN

In [95]:
# 내림차순 정렬하기
df.sort_index(ascending=False)

   value          name   age
4      5    Annan Jung   NaN
3      3           Lee   6.0
2      2           Tom  10.0
1      1  GilDong Hong   NaN
0      4      John Kim  12.0

In [96]:
# 특정 컬럼 기준 정렬 할 때 => sort_values()
# name 컬럼으로 정렬
df.sort_values(by='name')

   value          name   age
4      5    Annan Jung   NaN
1      1  GilDong Hong   NaN
0      4      John Kim  12.0
3      3           Lee   6.0
2      2           Tom  10.0

In [97]:
df.sort_values(by='name', ascending=False)
# 내림차순

   value          name   age
2      2           Tom  10.0
3      3           Lee   6.0
0      4      John Kim  12.0
1      1  GilDong Hong   NaN
4      5    Annan Jung   NaN

In [98]:
df.name[0], len(df.name[0])

('John Kim', 8)

In [99]:
[len(name) for name in df['name']]

[8, 12, 3, 3, 10]

In [112]:
# 이름 길이로 정렬
df['len']=[len(name) for name in df['name'] ]
pd.DataFrame( df['len'] )

   len
0    8
1   12
2    3
3    3
4   10

In [101]:
df.sort_values(by='len', ascending=False)

   value          name   age  len
1      1  GilDong Hong   NaN   12
4      5    Annan Jung   NaN   10
0      4      John Kim  12.0    8
2      2           Tom  10.0    3
3      3           Lee   6.0    3

In [102]:
# df.sort_values(by='name' )

## 컬럼명 정렬

In [103]:
df.columns, type(df.columns), list(df.columns)

(Index(['value', 'name', 'age', 'len'], dtype='object'),
 pandas.core.indexes.base.Index,
 ['value', 'name', 'age', 'len'])

In [104]:
colList=list(df.columns)
colList

['value', 'name', 'age', 'len']

In [105]:
colList.sort()

In [106]:
colList

['age', 'len', 'name', 'value']

In [107]:
df2=df[colList]
df2

    age  len          name  value
0  12.0    8      John Kim      4
1   NaN   12  GilDong Hong      1
2  10.0    3           Tom      2
3   6.0    3           Lee      3
4   NaN   10    Annan Jung      5

In [108]:
df3=df.T
df3

              0             1     2    3           4
value         4             1     2    3           5
name   John Kim  GilDong Hong   Tom  Lee  Annan Jung
age        12.0           NaN  10.0  6.0         NaN
len           8            12     3    3          10

In [109]:
df3.reset_index()

   index         0             1     2    3           4
0  value         4             1     2    3           5
1   name  John Kim  GilDong Hong   Tom  Lee  Annan Jung
2    age      12.0           NaN  10.0  6.0         NaN
3    len         8            12     3    3          10

In [110]:
df3.set_values('index')

AttributeError: 'DataFrame' object has no attribute 'set_values'